<div class="layout-flood">
	<h4><a href="#hashColumnize2" id="hashColumnize2" class="hashAnchor"><span class="mark">Две колонки <code>(class="columnize")</code></span></a></h4>
	<div class="columnize">
		<p>У всех шрифтов есть хотя бы одна сладкая точка; комбинация размеров, при котором шрифт лучше всего показывает себя на экране, точка, в которой анти-сглаживание, встроенное в браузеры, искажает дизайн шрифта как можно меньше.</p>
		<p>Сладкая точка — это обычно точка, в которой большинство штрихов соответствуют пиксельной сетке — пиксельные шрифты, если вы помните их, работали только в этой сладкой точке.</p>
	</div>
	<h4><a href="#hashColumnize3" id="hashColumnize3" class="hashAnchor"><span class="mark">Три колонки <code>(class="columnize--3")</code></span></a></h4>
	<div class="columnize--3">
		<p>Настроив шрифт в его сладкой точке, вы получите отличный контраст. Контраст частично важен при дизайне текста для мобильных устройств, потому что есть возможность возникновение отвлекающих бликов вне слабо освещенного экрана устройства.</p>
		<p>Вы обнаружите, что минимальные требования к интерлиньяжу — это подогнать строки под пиксели. Контраст является козырем в дизайне текста для мобильных устройств, поэтому вам нужно будет пожертвовать интерлиньяжем, чтобы удержать строки на этих пикселях.</p>
		<p>Стандартный подход для дизайнеров — это уложить шрифт, используя базовую сетку, но для мобильных экранов нам нужно будет использовать х-высоту (х-высота — это буквально высота строчной буквы «х»). Мы знаем, что мозг распознает верхушки слов, а не их нижние части, поэтому, чтобы получить отличный саккадный поток, нам нужно убедиться, что все верхушки наших символов находятся как можно плотнее к пикселям.</p>
	</div>
	<h4><a href="#hashColumnize4" id="hashColumnize4" class="hashAnchor"><span class="mark">Четыре колонки <code>(class="columnize--4")</code></span></a></h4>
	<div class="columnize--4">
		<p>Край — это граничная черта блока текста. Большинство людей привыкло читать текст, который равняется по левому краю, правый край которого в результате становится рваным.</p>
		<p>Когда ваш взгляд скачет от конца одной строки к следующей, мозгу проще судить об угле и длине следующего прыжка, если все прыжки последовательны. По этой причине левый край вашего текста должен быть ровным, каждая строка должна начинаться в том же месте, что и предыдущая (для языков, которые читаются с права на лево, все, соответственно, наоборот).</p>
		<p>Как результат, вам не стоит делать текст по центру больше двух или трех раз на общее количество текста.</p>
		<p>Часто текст равняется по ширине. Это значит, что слова в строке расположены соответственно друг другу, и рваного края нет ни с одной стороны. Такой способ выравнивания модный, так как отзывчивый дизайн научил дизайнеров думать в блоках. Выравнивая текст по ширине, вы получаете непостоянные пробелы и, в худшем случае, в строке оказывается всего несколько слов, что очень раздражает. Проблема с таким текстом усугубляется на мобильных устройствах, и текст становится нечитабельным.</p>
	</div>
</div>